'''
2. زمانی که دانا خواب بود دید که ۲ کیسه دارد که در هر کیسه اش حداقل ۱ تیله بود ...
 اما وقتی که از خواب بیدار شد تعداد تیله هایش یادش نبود.
 فقط میدانست  که تعداد تیله‌های کیسه اول مقسوم‌علیهی از عدد a بوده و تعداد تیله‌های کیسه دوم مقسوم علیهی از عدد b بوده است.
  همچنین دانا  به یاد دارد که دو کیسه‌اش خیلی سنگین نبودند و در مجموع حداکثر x تیله در دو کیسه قرار داشته است.
حالا دانا از ما میخواهد تا کمکش کنیم تعداد خواب های متفاوتی که دیده است را به دست آورد.
۳ تا عدد a, b , x رو به ترتیب در یک خط به عنوان ورودی داریم ، که :
1 <= a , b <= 1000
2 <= x <= 1000
example 1 :
2 2 2
answer :
1
example 2 :
7 7 14
answer :
4
'''

x, a, b = input().strip().split()
x = int(x)
a = int(a)
b = int(b)

# n1 % a == 0
# n1 % b == 0
# n1 + n2 < x

count = 0
for i in range(1, x + 1):
    for j in range(1, x + 1):
        if i % a == 0 and j % b == 0 and i + j <= x:
            count += 1

print(count)

# by Shervin Hasanzadeh
