'''
باتری تلفن همراه مرد مالیاتچی‌ تمام شده‌است.
می‌دانیم تلفن مرد مالیاتچی برای اینکه از ii درصد شارژ به i + 1i+1 درصد برسد i + 1i+1 دقیقه زمان می‌برد.
حال ما از شما می‌خواهیم با دریافت عدد kk بگویید چند دقیقه طول می‌کشد که تلفن مرد مالیاتچی از صفر درصد شارژ به kk درصد شارژ برسد.

ورودی
در یک خط عدد kk به شما داده می‌شود.
1 \le k \le 1001≤k≤100

خروجی
در یک خط مجموع دقایقی که طول می‌کشد را چاپ کنید.

i=30 -> 30+1 ch  => 30+1 min
'''

k = int(input())

j = 0
t = 0
for i in range(k):
    j += 1
    t += j

print(t)


# by Shervin Hasanzadeh
